school/5al/inglese/bit-by-bit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-27 Mon 14:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Bit By Bit</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Bit By Bit</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbabd4ee">1. Module 3 -&gt; Computer Programming</a>
<ul>
<li><a href="#org311e7f5">1.1. The C family</a></li>
<li><a href="#org1244537">1.2. HTML</a></li>
<li><a href="#orgeb6bb42">1.3. Java</a></li>
<li><a href="#orgd2cea23">1.4. Python</a></li>
<li><a href="#org035ab4a">1.5. Flowcharts</a></li>
<li><a href="#org79bc1f5">1.6. Writing a program</a></li>
<li><a href="#org690efe2">1.7. Testing and documenting</a></li>
</ul>
</li>
<li><a href="#org09a4505">2. Module 5 -&gt; The Internet</a>
<ul>
<li><a href="#orgb783b3a">2.1. History of the internet</a></li>
<li><a href="#org91ba5d2">2.2. Internet connection and services</a></li>
<li><a href="#org5a0198e">2.3. The world wide web, websites and web browsers</a>
<ul>
<li><a href="#orge6b7b07">2.3.1. Hypermedia</a></li>
<li><a href="#orgc5aadfd">2.3.2. Browser</a></li>
<li><a href="#org7e0ccae">2.3.3. Bookmarks</a></li>
<li><a href="#org8f497fc">2.3.4. Favorites</a></li>
<li><a href="#org1d0ef3c">2.3.5. URL</a></li>
</ul>
</li>
<li><a href="#org56573ca">2.4. Search engines and web search</a></li>
<li><a href="#org4e9cace">2.5. Wikis</a></li>
<li><a href="#orgb9dd03a">2.6. Email</a></li>
<li><a href="#org02df31e">2.7. Cloud computing</a>
<ul>
<li><a href="#org047ccb7">2.7.1. Infrastructure as a Service</a></li>
<li><a href="#org7790d1a">2.7.2. Platform as a Service</a></li>
<li><a href="#orge2723a4">2.7.3. Software as a Service</a></li>
<li><a href="#org790c95f">2.7.4. Public Cloud Computing</a></li>
<li><a href="#orgbf81511">2.7.5. Private Cloud Computing</a></li>
<li><a href="#orgf39da7c">2.7.6. Virtual private computing</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbabd4ee" class="outline-2">
<h2 id="orgbabd4ee"><span class="section-number-2">1.</span> Module 3 -&gt; Computer Programming</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org311e7f5" class="outline-3">
<h3 id="org311e7f5"><span class="section-number-3">1.1.</span> The C family</h3>
<div class="outline-text-3" id="text-1-1">
<p>
C is a general purpose systems programming language from which many modern programming
languages take inspiration of. It was an innovation from Assembly, a much more
complicated language.
</p>

<p>
C++ is derived and mostly compatible with C but has classes and allows object oriented programming
(OOP). It was created by Bjarne Stroutstrup in Bell Labs. It is also a low level language but allows
more abstractions than C.
</p>

<p>
On the other hand, C# is not as low level but is simpler to program with if compared with C
and is often used to create command line applications. With Visual C# it is easy to create
graphical applications for the Windows operating system.
</p>
</div>
</div>

<div id="outline-container-org1244537" class="outline-3">
<h3 id="org1244537"><span class="section-number-3">1.2.</span> HTML</h3>
<div class="outline-text-3" id="text-1-2">
<p>
HTML is a markup language used to create websites and documents. It allows to define the structure
of a page using an XML syntax. It is composed by tags, one inside another. Common tags are head,
body, h1, div.
</p>
</div>
</div>

<div id="outline-container-orgeb6bb42" class="outline-3">
<h3 id="orgeb6bb42"><span class="section-number-3">1.3.</span> Java</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Java is a general purpose high level language which was originally called Oak. Programs created with Java
are highly portable since they are not compiled to a native language, but instead to an intermediate
bytecode which is then interpreted by the Java Virtual Machine or JVM. Code can also be compiled on the
fly using JIT or Just in Time. Performance of Java applications is not comparable to performance of
compiled C and C++ code but this is often not a problem.
</p>
</div>
</div>

<div id="outline-container-orgd2cea23" class="outline-3">
<h3 id="orgd2cea23"><span class="section-number-3">1.4.</span> Python</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Java is a general purpose high level scripting language. It is dynamically typed, meaning that during
the lifetime of an object, its type can vary. Unlike other programming languages, it does not use
brackets but instead indentation. It does not require compilation, and for this reason, it is
extremely slower than C and C++, but it is also very easy to use.
</p>
</div>
</div>

<div id="outline-container-org035ab4a" class="outline-3">
<h3 id="org035ab4a"><span class="section-number-3">1.5.</span> Flowcharts</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Flowcharts are a way to design the program before actually writing it with code. It is a graphical
representation for structure and logic.
</p>
</div>
</div>

<div id="outline-container-org79bc1f5" class="outline-3">
<h3 id="org79bc1f5"><span class="section-number-3">1.6.</span> Writing a program</h3>
</div>
<div id="outline-container-org690efe2" class="outline-3">
<h3 id="org690efe2"><span class="section-number-3">1.7.</span> Testing and documenting</h3>
</div>
</div>

<div id="outline-container-org09a4505" class="outline-2">
<h2 id="org09a4505"><span class="section-number-2">2.</span> Module 5 -&gt; The Internet</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb783b3a" class="outline-3">
<h3 id="orgb783b3a"><span class="section-number-3">2.1.</span> History of the internet</h3>
</div>
<div id="outline-container-org91ba5d2" class="outline-3">
<h3 id="org91ba5d2"><span class="section-number-3">2.2.</span> Internet connection and services</h3>
</div>
<div id="outline-container-org5a0198e" class="outline-3">
<h3 id="org5a0198e"><span class="section-number-3">2.3.</span> The world wide web, websites and web browsers</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The world wide web was invented in CERN laboratories by Tim Berners-Lee. It is
an internet based hypermedia system for information sharing all over the world.
</p>
</div>

<div id="outline-container-orge6b7b07" class="outline-4">
<h4 id="orge6b7b07"><span class="section-number-4">2.3.1.</span> Hypermedia</h4>
</div>
<div id="outline-container-orgc5aadfd" class="outline-4">
<h4 id="orgc5aadfd"><span class="section-number-4">2.3.2.</span> Browser</h4>
</div>
<div id="outline-container-org7e0ccae" class="outline-4">
<h4 id="org7e0ccae"><span class="section-number-4">2.3.3.</span> Bookmarks</h4>
</div>
<div id="outline-container-org8f497fc" class="outline-4">
<h4 id="org8f497fc"><span class="section-number-4">2.3.4.</span> Favorites</h4>
</div>
<div id="outline-container-org1d0ef3c" class="outline-4">
<h4 id="org1d0ef3c"><span class="section-number-4">2.3.5.</span> URL</h4>
</div>
</div>

<div id="outline-container-org56573ca" class="outline-3">
<h3 id="org56573ca"><span class="section-number-3">2.4.</span> Search engines and web search</h3>
<div class="outline-text-3" id="text-2-4">
<p>
A search engine is a service that allows users to search in the entire web
for specific keywords. To gain informations, search engines use crawlers and
spiders that downloads content from websites in order to index it based on
some algorithms.
</p>

<p>
Some search engines also offer a more advanced way to search using a specific
syntax.
</p>
</div>
</div>

<div id="outline-container-org4e9cace" class="outline-3">
<h3 id="org4e9cace"><span class="section-number-3">2.5.</span> Wikis</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Wiki is a server software that allows users to collaborate to create a website based
on trust. The word comes from wikiwikiwiki which means fast in Hawaiian.
The first ever wiki was Wiki Wiki Web but the most known and largest wiki nowadays
is Wikipedia.
</p>
</div>
</div>

<div id="outline-container-orgb9dd03a" class="outline-3">
<h3 id="orgb9dd03a"><span class="section-number-3">2.6.</span> Email</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Email is a way of sending texts and documents to other people on the internet.
It can be accessed using a desktop or a web client.
There are a bunch of software that can be used to send and receive emails.
To send a mail to someone, you must know their email address, which is composed
by a name and a domain managed by your ISP or other companies.
</p>
</div>
</div>

<div id="outline-container-org02df31e" class="outline-3">
<h3 id="org02df31e"><span class="section-number-3">2.7.</span> Cloud computing</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org047ccb7" class="outline-4">
<h4 id="org047ccb7"><span class="section-number-4">2.7.1.</span> Infrastructure as a Service</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
Rent virtual machines
</p>
</div>
</div>
<div id="outline-container-org7790d1a" class="outline-4">
<h4 id="org7790d1a"><span class="section-number-4">2.7.2.</span> Platform as a Service</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
Rent a platform where developer can work on without having to manage
the underlying hardware
</p>
</div>
</div>
<div id="outline-container-orge2723a4" class="outline-4">
<h4 id="orge2723a4"><span class="section-number-4">2.7.3.</span> Software as a Service</h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
Rent services without having to manage the underlying infrastructure by yourself
</p>
</div>
</div>

<div id="outline-container-org790c95f" class="outline-4">
<h4 id="org790c95f"><span class="section-number-4">2.7.4.</span> Public Cloud Computing</h4>
<div class="outline-text-4" id="text-2-7-4">
<p>
The hardware is shared with other users which pay based on what they use
</p>
</div>
</div>
<div id="outline-container-orgbf81511" class="outline-4">
<h4 id="orgbf81511"><span class="section-number-4">2.7.5.</span> Private Cloud Computing</h4>
<div class="outline-text-4" id="text-2-7-5">
<p>
The hardware is dedicated to a single company or entity which pays a fixed
amount.
</p>
</div>
</div>
<div id="outline-container-orgf39da7c" class="outline-4">
<h4 id="orgf39da7c"><span class="section-number-4">2.7.6.</span> Virtual private computing</h4>
<div class="outline-text-4" id="text-2-7-6">
<p>
A mix of the two, like sharing an holiday apartment with other people.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2022-06-27 Mon 14:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
